In [1]:
import pandas as pd
import numpy as np

In [2]:
my_data = np.array([[10,20,30], [20,30,40], [20,50,10],[10,15,20]]) #liste içinde listelere oluşturduk.

In [3]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [4]:
my_names = ["james","lars","kirk","rob"]

In [5]:
my_columns = ["jan","feb","mar"]

In [6]:
my_data_frame = pd.DataFrame(my_data) #mydata oluşturduk ve bunu dataframe'e aktardık.

In [7]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  20

In [8]:
type(my_data_frame)

pandas.core.frame.DataFrame

In [9]:
my_data_frame[0] #ilk kolonu getirdi.

0    10
1    20
2    20
3    10
Name: 0, dtype: int32

In [10]:
new_data_frame = pd.DataFrame(my_data, index=my_names, columns= my_columns)

In [11]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [12]:
new_data_frame["feb"] #şubat'ı bize getirdi.

james    20
lars     30
kirk     50
rob      15
Name: feb, dtype: int32

In [13]:
type(new_data_frame["feb"]) #dataframe serilerin yanyana gelmesiyle oluşan bir yapıdır.

pandas.core.series.Series

In [14]:
#şubat ayındak ortalama maaş
feb_series = new_data_frame["feb"]  #şubatı yeni değişkene atadık.

In [16]:
feb_series.mean() #ortalamasını aldık.

28.75

In [17]:
feb_series.lars #lars kişisini getir dedik.

30

In [18]:
feb_series.max() #maksimum değer.

50

In [20]:
new_data_frame["jan"].mean() #bu şekilde de ortalamasını alabiliriz. Dataframe oldukça esnektir.

15.0

In [21]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [22]:
new_data_frame[["jan","feb"]] #sadece jan ve feb'i gösterdi. liste içinde liste şeklinde yaptık.

       jan  feb
james   10   20
lars    20   30
kirk    20   50
rob     10   15

In [23]:
new_data_frame.loc["lars"] #lars içindeki değerleri getirdi.

jan    20
feb    30
mar    40
Name: lars, dtype: int32

In [24]:
type(new_data_frame.loc["lars"])

pandas.core.series.Series

In [25]:
new_data_frame.loc["rob"].mean() #maaş ortalaması.

15.0

In [26]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [27]:
new_data_frame.iloc[3] #iloc index location. BUrada 3 verdeğimiz zaman indexini vermiş oluruz ve bize rob'un değerlerini getirmiş olur.

jan    10
feb    15
mar    20
Name: rob, dtype: int32

In [28]:
#nisan yaında martta kazanılanların iki katı kaznaılmış bunu data frame'e eklemek istiyoruz.
new_data_frame["apr"] = new_data_frame["mar"] *2 #bu şekilde april'i march'ı 2 ile çarparak bulduk ve datframe'e ekledik.

In [29]:
new_data_frame

       jan  feb  mar  apr
james   10   20   30   60
lars    20   30   40   80
kirk    20   50   10   20
rob     10   15   20   40

In [30]:
#verilerin içinden rob'un verilerini çıkarmak istiyoruz.
new_data_frame.drop("rob", axis=0) #drop düşürmek demektir. bu şekilde rob'u çıkarabiliriz.axis = 0 dersek satırdan düşürür.

       jan  feb  mar  apr
james   10   20   30   60
lars    20   30   40   80
kirk    20   50   10   20

In [31]:
new_data_frame #drop yeni datframe döndürür. orijinalini bozmaz.

       jan  feb  mar  apr
james   10   20   30   60
lars    20   30   40   80
kirk    20   50   10   20
rob     10   15   20   40

In [32]:
new_data_frame.drop("apr",axis=1) #nisanı datframe'den düşürdük. axis = 1 dersek kolonu düşürür.

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [33]:
new_data_frame #orijinal hala durur. drop'u başka değişkene kaydederke elimizde tutabiliriz.

       jan  feb  mar  apr
james   10   20   30   60
lars    20   30   40   80
kirk    20   50   10   20
rob     10   15   20   40

In [34]:
new_data_frame.drop("apr", axis=1, inplace=True) #inplcae içinde bunu yap demektir. inplace = true yaptığımız zaman bu dataframe'de kalıcı olarak değişiklik yapar.

In [35]:
new_data_frame #april gitmiş.

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [39]:
new_data_frame["jan"].lars #jan içinden lars'ı aldık.

20

In [40]:
new_data_frame["jan"]["lars"] #bu şekilde de getirebiliriz. mesela lars jan ayında ne kadar kazanmış.

20

In [41]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [42]:
#o anki kazanc 25'ten büyük olanlar
boolean_frame = new_data_frame > 25 #25'ten büyük olanları göster.

In [43]:
boolean_frame #25'ten büyük olanlar true'dur.

         jan    feb    mar
james  False  False   True
lars   False   True   True
kirk   False   True  False
rob    False  False  False

In [44]:
new_data_frame[boolean_frame] #küçük olanlara nan verir. öyle bir değer yok der.

       jan   feb   mar
james  NaN   NaN  30.0
lars   NaN  30.0  40.0
kirk   NaN  50.0   NaN
rob    NaN   NaN   NaN

In [45]:
new_data_frame[new_data_frame > 30] #ayrı bir şeye atamadan da gösterebiliriz. 30'dan büyük olanları gösterdi.

       jan   feb   mar
james  NaN   NaN   NaN
lars   NaN   NaN  40.0
kirk   NaN  50.0   NaN
rob    NaN   NaN   NaN

In [46]:
#sadece mart ayında 25'ten büyük olanları görmek istiyorsak.
new_data_frame[new_data_frame["mar"] > 25] #newdataframe içinde newdataframe ile mart ayında 25'ten büyük olanlar.

       jan  feb  mar
james   10   20   30
lars    20   30   40

In [47]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [48]:
new_data_frame.reset_index() #isimlerin yanına kendi indexlerini koyar.

   index  jan  feb  mar
0  james   10   20   30
1   lars   20   30   40
2   kirk   20   50   10
3    rob   10   15   20

In [49]:
new_data_frame

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20

In [50]:
new_data_frame["newIndex"] = ["jam","lar","kir","rb"] #newındex isimli yeni bir kolon oluşturduk.

In [51]:
new_data_frame

       jan  feb  mar newIndex
james   10   20   30      jam
lars    20   30   40      lar
kirk    20   50   10      kir
rob     10   15   20       rb

In [52]:
new_data_frame.set_index("newIndex") #newındex kolonunu başa aldık.

          jan  feb  mar
newIndex
jam        10   20   30
lar        20   30   40
kir        20   50   10
rb         10   15   20

In [53]:
new_data_frame #orijinali korunur.

       jan  feb  mar newIndex
james   10   20   30      jam
lars    20   30   40      lar
kirk    20   50   10      kir
rob     10   15   20       rb

In [55]:
new_data_frame.drop("newIndex",axis=1, inplace=True)

In [56]:
new_data_frame #kalıcı silindi inplace ile.

       jan  feb  mar
james   10   20   30
lars    20   30   40
kirk    20   50   10
rob     10   15   20